vonnieda/esp32-flight-tracker/sdkconfig.defaults
# WT32-SC01 Plus (ESP32-S3, 16MB QIO flash, 2MB QSPI PSRAM)
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y

# LVGL wants a decently sized main task stack; the UI + touch handling run on it.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

CONFIG_FREERTOS_HZ=1000
